meeting/minutes/2023/03-14.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 026 Minutes 2023-03-14</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 026 Minutes 2023-03-14</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#minutes">Minutes</a></li>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/9]</code></a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[9/12]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#approve-minutes">1.3. Approve minutes of the previous meeting</a></li>
<li><a href="#next-meeting">1.4. Next meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[7/15]</code></a></li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical Agenda</a>
<ul>
<li><a href="#h-29A87C61-D673-4C02-AF2C-DC56FD7B0F9F">2.1. Record types</a></li>
<li><a href="#h-29972C1F-44ED-4967-A11B-87E12F9B9123">2.2. PR #368: Issue 129 - Context item generalized to context value</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
<li><a href="#adjourned">4. Adjourned</a></li>
</ul>
</div>
</div>

<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Minutes</h2>
<div class="outline-text-2" id="text-minutes">
<p>
Approved <a href="./03-21.html">at meeting 027</a> on 21 March 2023.
</p>
</div>
</div>

<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/9]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-08: RD to clarify how namespace comparisons are performed.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-023-01: NW to review the stylesheets for functions across XPath and XSLT</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-024-01: MK to add namespace-uri-for-prefix argument changes to the compatibility appendix</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-024-02: DN to develop an alternative proposal for deep-action.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-025-02: MK to make the context function properties simple values instead of functions</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-025-03: MK to revise and expand technical detail in PR #375</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-025-04: RD to remove the note in 15.5.15 of functions and operators.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-026-01: MK to write a summary paper that outlines the decisions we need to make on “value sequences”</li>
</ul>
</div>
</div>


<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[9/12]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: BTW, JK
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Anthony (Tony) Bufort (AB)</li>
<li class="on"><code>[X]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Sasha Firsov (SF)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="off"><code>[&#xa0;]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> John Lumley (JL)</li>
<li class="on"><code>[X]</code> Dimitre Novatchev (DN)</li>
<li class="on"><code>[X]</code> Ed Porter (EP)</li>
<li class="on"><code>[X]</code> C. M. Sperberg-McQueen (MSM)</li>
<li class="off"><code>[&#xa0;]</code> Bethan Tovey-Walsh (BTW)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW). <i>Scribe</i>. <i>Chair</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2023/03-14.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2023/03-07.html">the minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting <a href="../../agenda/2023/03-21.html">is scheduled for Tuesday, 21 March 2023</a>.
</p>

<p>
ATTENTION: This meeting is scheduled at 16:00 local time in Europe and the UK.
The United States switched to Daylight Saving Time starting on Sunday,
12 March 2023. Until Europe and the UK switch to summer time (on 26
March 2023), this meeting will be one hour <b>later</b> in the United
States.
</p>

<p>
No regrets heard.
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[7/15]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-08: RD to clarify how namespace comparisons are performed.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-023-01: NW to review the stylesheets for functions across XPath and XSLT</li>
<li class="on"><code>[X]</code> QT4CG-023-05: NW to put record types on an agenda.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-024-01: MK to add namespace-uri-for-prefix argument changes to the compatibility appendix</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-024-02: DN to develop an alternative proposal for deep-action.</li>
<li class="on"><code>[X]</code> QT4CG-025-01: NW to close the issues we agreed to close in meeting 024</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-025-02: MK to make the context function properties simple values instead of functions</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-025-03: MK to revise and expand technical detail in PR #375</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-025-04: RD to remove the note in 15.5.15 of functions and operators.</li>
<li class="on"><code>[X]</code> QT4CG-025-05: MK to correct the accidental deletion in 3.6.2 of XQuery</li>
<li class="on"><code>[X]</code> QT4CG-025-06: NW to fix the “blue boxes” in the serialization specification</li>
<li class="on"><code>[X]</code> QT4CG-025-07: MK to update the text about for/let changes to use use definitions and termrefs correctly.</li>
<li class="on"><code>[X]</code> QT4CG-025-08: MK to add an error code for the case where <code>member</code> is used on something that isn’t an array</li>
<li class="on"><code>[X]</code> QT4CG-025-09: NW to add the parse-uri and build-uri tests to the test suite</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
<p>
This agenda begins with record types, proposed for the agenda some
weeks ago, followed by a few more substantial PRs then a few small PRs.
</p>
</div>
