meeting/minutes/2023/03-14.org
** Record types
:PROPERTIES:
:CUSTOM_ID: h-29A87C61-D673-4C02-AF2C-DC56FD7B0F9F
:END:

In [[https://qt4cg.org/meeting/minutes/2023/02-21.html#h-5ACE0622-A613-4026-9074-C7492E84CC15][meeting 023]], we encountered the proposal for a new pattern syntax,
~(type(T), record(N, M, N))~ that allows matching of items by item type.
This needs CG discussion.

+ MK: We’re doing a lot of things that are building on top of that
  syntax but we’ve never agreed to it.
  + … There may be some loose ends that are worth discussing (esp. in
    XSLT with respect to patterns).

MK shares XQuery-40#id-record-test

+ MK: Record is used instead of tuple because tuples are often unnamed.

+ MK describes the design presented in the spec.
  + … Limited recursion is allowed; a record can refer to itself.
  + … Record types would have to be able to name each other if we
    wanted more comprehensive support for recursive types.
  + … The subtyping rules are a bit complicated; review encouraged!
  + … Considered doing the subtyping rule intentionally but tried to
    spell them out instead.
  + … Largely meets requirements except for the ability to name record
    types by reference.
+ MSM: I have to ask what might seem like a dumb question, as far as I
  can tell, everything you’ve described I can do with maps, but not
  quite vice-versa. Why do we need records in addition to maps?
+ MK: We’re not introducing new values, we’re introducing new types.
  It’s a way of constraining the values that can be in a map.
+ MSM: That’s an excellent answer! And in that case the subtyping
  rules are important.
+ RD: I raised [[https://github.com/qt4cg/qtspecs/issues/52][an issue]] a while ago about allowing “*” in a record,
  like we can in maps. It would be a useful alias.
+ MK: I’m sort of neutral; I don’t think it’s necessary but I’m not
  strongly opposed.
+ JL: RD, are you implying that it would be an alias?
+ MK: Yes, that’s what it would be if we allowed it. We’d just be
  saying that we didn’t require at least one field.
+ DN: I want to add something to what RD is saying; I see the value of
  “*” but for me the big step from maps to records is that I regard
  them as typed maps. So adding the “*” makes them less strictly type.
  Could we have “strict” and “untyped” records?
+ RD: A =record(*)= would be an untyped record type. See #id-map-test.
  The same pattern would apply to records.
+ MSM: If I understood MK’s description at the outset correctly, saying
  “this can be any record” is not the same as saying “this can be any map”. So when
  we said “it would be just be a synonym for map(*)” did I misunderstand?
+ MK: No, I think that would be a synonym. The star allows you to have
  anything else and if the anything is empty, that’s just like a map.
+ MSM: So if I have a “*” I no longer have the constraints on recursion?
+ MK: The only constraint on recursion is that you can’t constrain it.
  You can always have a field that can contain any map. What’s
  difficult is to say that it must contain one of these.
+ MSM: So the checking is not quite as tight as I’d thought. And if I
  have an exensible record, is that different from =map(*)=? I guess
  if I declared some fields as required.
+ MK: Yes, you’re expressing constraints on keys.
+ RD: As an example, the serialize function takes an option map and we
  could define it as a record type that constrains the various fields
  like =output= and things like that. And then allow unconstrained extensions.
+ DN: This discussion only amplifies for me that the real value of
  record without a “*”. The most important achievement of records is
  it’s strict type. 
+ MK: When you’re using record types in XSLT style processing with
  match patterns, it turns out you very often want to specify just
  enough of the map to make it match uniquely. For example, if you
  want to match the kinds of records you get in JSON to represent
  employees, you want to be able to say this has a key called
  “social-security-number” so I’m going to assume it’s an employee.
+ DN: Yes, but it makes me think about some kind of subtyping
  relationship between records.
+ DN: The fields are unordered, but we’re defining the record
  presenting the fields in some order. Maybe it would be good to think
  of some sort of normalized presentation…I don’t know.
+ MK: You’ve got to be careful about that because at the moment,
  instances of a record type don’t have any flag that says a map is of
  a particular record type. A map can conform to many different record
  types; there’s no intrinsic type.
+ DN: We should also think about the =instance of= operator when the
  right hand side is a record. And maybe we should think about
  =deep-equal= as well.
+ MK: You can’t say that an item is a kind of record; we only have tests.
+ RD: You can think about it like duck typing in Python or the way
  that JSON bindings are bindings are implemented in typescript where
  you’ve got a Java object that represents your JSON but you don’t
  know whether it conforms so you have to check if it is an instance
  of that, which you do by checking it’s properties. That’s similar to how records
  work here.
+ JL: MK, the self-referential “..” is strictly to the parent of the
  type. Is there any case where you might want to point back up to the
  grand-parent?
+ MK: That’s typically where you want mutual recursion. A use case for
  that, I tried to model the schema component model with maps. If you
  do that, then every component as a record type and you want a graph
  of them pointing to each other so you’d like mutual recursion to
  describe that structure.
  + … The fact that you can’t construct a graph of maps is a different
    problem!

Some discussion of how the self-reference only works one level deep.

+ RD: You could describe a binary tree.
+ MK: I think John Snelson wrote something about this a while back. He
  was a head of his time with respect to making tuples in to named
  types that could refer to each other.

Proposal: We accept this as a consensus position.

Accepted.

