meeting/minutes/2023/03-14.org
** PR #368: Issue 129 - Context item generalized to context value
:PROPERTIES:
:CUSTOM_ID: h-29972C1F-44ED-4967-A11B-87E12F9B9123
:END:

See PR [[https://qt4cg.org/dashboard/#pr-368][#368]].

+ CG walks us through the PR.
+ CG: Issue #129 proposes expanding context item to context value.
  + … The sequence of items or nodes could also be bound externally.
  + … We could have a fat arrow operator to bind them.
  + … We consider using “.” to represent the context item and “~” to
    refer to the context value.
  + … Thanks to MK for helping to make a full proposal.

(The diff is a bit confusing because the sections have been reorganized.)

+ MK: My first thought was that this was going to be very disruptive
  because the notion that “.” is a singleton is so embedded. So if
  we’re going to have one, let’s try to make it a slightly different
  thing and keep the context item with it’s current semantics.
  I explored how it works in XPath and XQuery and it works quite nicely.
  + … We define a fixed relation between them. If the context value is a singleton, 
    then “.” and “~” are the same thing.
  + … Then I found some useful things you can do with “~” like
    defining things over arrays.
  + … But what do you do about path expressions and axis steps?
    + … Should absolute paths use the context value and allow multiple root nodes?
    + … And what about relative path expressions?
    + … What scares me from an implementation point of view is that we
      might not be able to eliminate a lot of sorting into document
      order at compile time.
    + … Lots of times we know that the result will be a singleton so
      that we don’t have to do the sort. Now we might not know that
      until runtime.
    + … The compromise in this proposal is that absolute path
      expressions allow multiple selection. But using “!” not “/”.
      This can lead to unnecessary sorting.
    + … It’s certainly nice to do array filtering.
+ CG: We started from the very beginning to allow sequences of items
  in the path expression because that’s common in databases.
  + … People have become used to getting ordered and duplicate free
    results from path expressions.
  + … We could also optionally allow multiple nodes as input to
    absolute paths, but allow processors to raise errors.
+ MK: What do you do about document order for different documents in a
  database?
+ CG: It’s like fragments; every fragment has an ID which can be used
  for comparison. So documents stored sooner are “before” documents
  stored later.
+ MK: I wonder if someone could relax the constraints on “/” sorting
  into document order to say that in the case where you’re sorting
  multiple documents, the results are in arbitrary order rather than
  in some consistent order.

Some discussion of the consequences. You’d allow documents in
arbitrary order but document-order values for items from documents

+ RD: What’s the motivation for keeping the results in document order?
+ CG: You can have queries like ~document {<xml><a/><a/></xml>}//a => { /xml }~
  which would return two copies of “xml”.

“Where are we,” asks the scribe?

+ MK: We’ve jumped over the easy bits and just talked about the hard
  bits. The key thing is tha that the idea of context values does
  allow us to have array predicates.

CG shows us an example from XQuery 4.0 section 4.13.3.2.

+ NW: Is the proposal to accept this PR?
+ MK: It definitely needs more work because we need to work through
  the issues for XSLT.
+ DN: For the predicates for arrays, I have difficulty understanding.
  I made a proposal for “composite path language” that I think would
  give a much better syntax. I think “/” is going to be confusing. I
  think that it leads a lot more attention and investigation. It seems
  a little too complicated. Introducing new symbols doesn’t seem
  natural.
+ NW: What can we do to facilitate getting more work done here?
+ SF: We need to gather some examples of some of the other options,
  for example what is DN’s syntax.
+ DN: I don’t remember having read this in depth.

ACTION QT4CG-026-01: MK to write a summary paper that outlines the decisions we need to make on “value sequences”

+ RD: It would also be useful to have some motivating examples.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

DN shares some ideas for deep-equal-sequence.

+ DN: The current proposal for =deep-equal= is very long and complicated.
  + … We could have =deep-equal-sequence= that expands to =deep-equal-item=.
  + … =deep-equal-item= can expand to =deep-equal-atomic=, =deep-equal-map=,
    =deep-equal-array=, =deep-equal-array=, =deep-equal-node=.
  + … =deep-equal-map= uses =deep-equal-atomic= and =deep-equal-sequence=
  + … =deep-equal-array= uses =deep-equal-sequence=
  + … =deep-equal-node= uses different functions for the different node features
  + … We would also have =deep-equal-set= for things like attributes.
+ DN: On every level we would have greater understandability; we can
  construct the whole from these parts.
  + … This technique could also be applied to other things like parsing HTML.
  + … I think this would be a better technique generally.
+ MSM: I like this idea a lot, I like the idea of having the structure
  of a function like =deep-equal= be as far as possible be visually
  and obviously similar to the recursive definition of the structure
  of our data model. This seems like it would be useful for us and for
  readers.
+ RD: I think this is interesting. My only concern is in specifying
  options that apply to nested calls.

Chair proposes that DN create a new issue to track this

* Adjourned
:PROPERTIES:
:CUSTOM_ID: adjourned
:END:

We ran out of time.
