meeting/minutes/2023/03-14.html

<div id="outline-container-h-29972C1F-44ED-4967-A11B-87E12F9B9123" class="outline-3">
<h3 id="h-29972C1F-44ED-4967-A11B-87E12F9B9123"><span class="section-number-3">2.2.</span> PR #368: Issue 129 - Context item generalized to context value</h3>
<div class="outline-text-3" id="text-h-29972C1F-44ED-4967-A11B-87E12F9B9123">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-368">#368</a>.
</p>

<ul class="org-ul">
<li>CG walks us through the PR.</li>
<li>CG: Issue #129 proposes expanding context item to context value.
<ul class="org-ul">
<li>… The sequence of items or nodes could also be bound externally.</li>
<li>… We could have a fat arrow operator to bind them.</li>
<li>… We consider using “.” to represent the context item and “~” to
refer to the context value.</li>
<li>… Thanks to MK for helping to make a full proposal.</li>
</ul></li>
</ul>

<p>
(The diff is a bit confusing because the sections have been reorganized.)
</p>

<ul class="org-ul">
<li>MK: My first thought was that this was going to be very disruptive
because the notion that “.” is a singleton is so embedded. So if
we’re going to have one, let’s try to make it a slightly different
thing and keep the context item with it’s current semantics.
I explored how it works in XPath and XQuery and it works quite nicely.
<ul class="org-ul">
<li>… We define a fixed relation between them. If the context value is a singleton, 
then “.” and “~” are the same thing.</li>
<li>… Then I found some useful things you can do with “~” like
defining things over arrays.</li>
<li>… But what do you do about path expressions and axis steps?
<ul class="org-ul">
<li>… Should absolute paths use the context value and allow multiple root nodes?</li>
<li>… And what about relative path expressions?</li>
<li>… What scares me from an implementation point of view is that we
might not be able to eliminate a lot of sorting into document
order at compile time.</li>
<li>… Lots of times we know that the result will be a singleton so
that we don’t have to do the sort. Now we might not know that
until runtime.</li>
<li>… The compromise in this proposal is that absolute path
expressions allow multiple selection. But using “!” not “/”.
This can lead to unnecessary sorting.</li>
<li>… It’s certainly nice to do array filtering.</li>
</ul></li>
</ul></li>
<li>CG: We started from the very beginning to allow sequences of items
in the path expression because that’s common in databases.
<ul class="org-ul">
<li>… People have become used to getting ordered and duplicate free
results from path expressions.</li>
<li>… We could also optionally allow multiple nodes as input to
absolute paths, but allow processors to raise errors.</li>
</ul></li>
<li>MK: What do you do about document order for different documents in a
database?</li>
<li>CG: It’s like fragments; every fragment has an ID which can be used
for comparison. So documents stored sooner are “before” documents
stored later.</li>
<li>MK: I wonder if someone could relax the constraints on “/” sorting
into document order to say that in the case where you’re sorting
multiple documents, the results are in arbitrary order rather than
in some consistent order.</li>
</ul>

<p>
Some discussion of the consequences. You’d allow documents in
arbitrary order but document-order values for items from documents
</p>

<ul class="org-ul">
<li>RD: What’s the motivation for keeping the results in document order?</li>
<li>CG: You can have queries like <code>document {&lt;xml&gt;&lt;a/&gt;&lt;a/&gt;&lt;/xml&gt;}//a =&gt; { /xml }</code>
which would return two copies of “xml”.</li>
</ul>

<p>
“Where are we,” asks the scribe?
</p>

<ul class="org-ul">
<li>MK: We’ve jumped over the easy bits and just talked about the hard
bits. The key thing is tha that the idea of context values does
allow us to have array predicates.</li>
</ul>

<p>
CG shows us an example from XQuery 4.0 section 4.13.3.2.
</p>

<ul class="org-ul">
<li>NW: Is the proposal to accept this PR?</li>
<li>MK: It definitely needs more work because we need to work through
the issues for XSLT.</li>
<li>DN: For the predicates for arrays, I have difficulty understanding.
I made a proposal for “composite path language” that I think would
give a much better syntax. I think “/” is going to be confusing. I
think that it leads a lot more attention and investigation. It seems
a little too complicated. Introducing new symbols doesn’t seem
natural.</li>
<li>NW: What can we do to facilitate getting more work done here?</li>
<li>SF: We need to gather some examples of some of the other options,
for example what is DN’s syntax.</li>
<li>DN: I don’t remember having read this in depth.</li>
</ul>

<p>
ACTION QT4CG-026-01: MK to write a summary paper that outlines the decisions we need to make on “value sequences”
</p>

<ul class="org-ul">
<li>RD: It would also be useful to have some motivating examples.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
DN shares some ideas for deep-equal-sequence.
</p>

<ul class="org-ul">
<li>DN: The current proposal for <code>deep-equal</code> is very long and complicated.
<ul class="org-ul">
<li>… We could have <code>deep-equal-sequence</code> that expands to <code>deep-equal-item</code>.</li>
<li>… <code>deep-equal-item</code> can expand to <code>deep-equal-atomic</code>, <code>deep-equal-map</code>,
<code>deep-equal-array</code>, <code>deep-equal-array</code>, <code>deep-equal-node</code>.</li>
<li>… <code>deep-equal-map</code> uses <code>deep-equal-atomic</code> and <code>deep-equal-sequence</code></li>
<li>… <code>deep-equal-array</code> uses <code>deep-equal-sequence</code></li>
<li>… <code>deep-equal-node</code> uses different functions for the different node features</li>
<li>… We would also have <code>deep-equal-set</code> for things like attributes.</li>
</ul></li>
<li>DN: On every level we would have greater understandability; we can
construct the whole from these parts.
<ul class="org-ul">
<li>… This technique could also be applied to other things like parsing HTML.</li>
<li>… I think this would be a better technique generally.</li>
</ul></li>
<li>MSM: I like this idea a lot, I like the idea of having the structure
of a function like <code>deep-equal</code> be as far as possible be visually
and obviously similar to the recursive definition of the structure
of our data model. This seems like it would be useful for us and for
readers.</li>
<li>RD: I think this is interesting. My only concern is in specifying
options that apply to nested calls.</li>
</ul>

<p>
Chair proposes that DN create a new issue to track this
</p>
</div>
</div>

<div id="outline-container-adjourned" class="outline-2">
<h2 id="adjourned"><span class="section-number-2">4.</span> Adjourned</h2>
<div class="outline-text-2" id="text-adjourned">
<p>
We ran out of time.
</p>
</div>
</div>
</div>
</body>
</html>